DataProcessors/УправлениеНастройкамиПрямогоОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>УправлениеНастройкамиПрямогоОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/УзлыПрямогоОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>УзлыПрямогоОбменаДанными</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСтрокиПодключенияУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХешИдентификатораУзла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтотУзел</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбработчикДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоположениеWSDL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URIПространстваИменСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТочкиПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоМенеджераОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелОбмена</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыПрямогоОбменаДанными</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМетода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВызываемогоСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/УправлениеНастройкамиПрямогоОбмена/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция СформироватьХешИдентификаторУзла(ИдентификаторСтрока) Экспорт 
	
	ЗначениеВозврата = "";
	
	ОбрабатываемаяСтрока = ВРег(ИдентификаторСтрока);
	ОбрабатываемаяСтрока = СтрЗаменить(ОбрабатываемаяСтрока, " ","");
	
	Хеш = новый ХешированиеДанных(ХешФункция.MD5);
	
	Хеш.Добавить(ОбрабатываемаяСтрока);
	
	ЗначениеВозврата = "" + Хеш.ХешСумма;
	ЗначениеВозврата = СтрЗаменить(ЗначениеВозврата, " ", "");
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Функция ПолучитьДанныеУзлаОбменаПоХешИдентификатору(ИдентификаторУзла) Экспорт
	
	ЗначениеВозврата = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	УзлыПрямогоОбменаДанными.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УзлыПрямогоОбменаДанными КАК УзлыПрямогоОбменаДанными
		|ГДЕ
		|	УзлыПрямогоОбменаДанными.Код = &ХешИдентификатораУзла
		|	И УзлыПрямогоОбменаДанными.ПометкаУдаления = Ложь";
	//
	Запрос.УстановитьПараметр("ХешИдентификатораУзла", ИдентификаторУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Функция ПолучитьДанныеУзлаОбменаПоНаименованию(НаименованиеУзла) Экспорт
	
	ЗначениеВозврата = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	УзлыПрямогоОбменаДанными.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УзлыПрямогоОбменаДанными КАК УзлыПрямогоОбменаДанными
		|ГДЕ
		|	УзлыПрямогоОбменаДанными.ПометкаУдаления = ЛОЖЬ
		|	И УзлыПрямогоОбменаДанными.Наименование = &НаименованиеУзла";
	//
	Запрос.УстановитьПараметр("НаименованиеУзла", НаименованиеУзла);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗначениеВозврата = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ЗначениеВозврата;
	
КонецФункции

// Функция - Подготовить данные для обработки
// 		Распаковывает данные и подготавливает их для дальнейшей обработки
// Параметры:
//  ВходящиеДанные - Произвольный - ХранилищеЗначения (ДвоичныеДанные - XML) - XML сообщение из базы источника
// 
// Возвращаемое значение:
//   ВходящиеДанные:ХранилищеЗначения - ЧтениеXML
//
Функция ПодготовитьДанныеДляОбработки(ВходящиеДанные, ТипЗнчВозврата = "ПостроительDOM") Экспорт

	ЗначениеВозврата = Неопределено;
	
	Если ТипЗнч(ВходящиеДанные) = Тип("ХранилищеЗначения") Тогда
		
		Данные = ВходящиеДанные.Получить();	
		
		Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
			Поток = Данные.ОткрытьПотокДляЧтения();
			
			Если ТипЗнчВозврата = "ЧтениеXML" Тогда
				ЧтениеXML = новый ЧтениеXML;
				ЧтениеXML.ОткрытьПоток(Поток);
				ЗначениеВозврата = ЧтениеXML;
			ИначеЕсли ТипЗнчВозврата = "ПостроительDOM" Тогда
				ЧтениеXML = новый ЧтениеXML;
				ЧтениеXML.ОткрытьПоток(Поток);
				ПостроительDOM = Новый ПостроительDOM;
				ЗначениеВозврата = ПостроительDOM.Прочитать(ЧтениеXML);
			Иначе
				ЗначениеВозврата = ПолучитьСтрокуИзДвоичныхДанных(Данные);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			ЗначениеВозврата = Данные;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Процедура ВыполнитьСобытиеПрямогоОбменаНасервере(УзелИсточник, УзелПолучатель, ИмяМетода, ИмяВызываемогоСобытия, ИмяПредопределенногоМенеджераОбмена) Экспорт
	
	ОбработкаОбъект = Вычислить("Обработки." + ИмяПредопределенногоМенеджераОбмена + ".Создать()");//РеквизитФормыВЗначение("Объект");
	
	Результат = Вычислить("ОбработкаОбъект." + ИмяМетода + "(УзелПолучатель.Наименование)");
	
	Если Результат.Отказ = Истина Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСтандартныеАтрибутыДокументаDOM(СтруктураДокумента, ДокументDOM) Экспорт 
	
	Атрибуты = ДокументDOM.Атрибуты;

	СтруктураДокумента.Вставить("ДокументГУИД", Атрибуты.ПолучитьИменованныйЭлемент("", "ДокументГУИД").Значение);
	
	СтруктураДокумента.Вставить("ВидОбъекта", Атрибуты.ПолучитьИменованныйЭлемент("", "ВидОбъекта").Значение);
	СтруктураДокумента.Вставить("ТипОбъекта", Атрибуты.ПолучитьИменованныйЭлемент("", "ТипОбъекта").Значение);
	СтруктураДокумента.Вставить("ПометкаУдаления", Булево(Число(Атрибуты.ПолучитьИменованныйЭлемент("", "ПометкаУдаления").Значение)));
	СтруктураДокумента.Вставить("ЭтоДанныеНабораЗаписей",  Булево(Число(Атрибуты.ПолучитьИменованныйЭлемент("", "ЭтоДанныеНабораЗаписей").Значение)));
	
	Проведен = Атрибуты.ПолучитьИменованныйЭлемент("", "Проведен").Значение;
	Если Проведен <> Неопределено Тогда
		СтруктураДокумента.Вставить("Проведен", Булево(Число(Проведен)));
	КонецЕсли;
	
	Организация = Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияГУИД");
	Если Организация <> Неопределено Тогда  
		
		СтруктураОрганизация = ЗагрузитьДанные_Организцаия(Атрибуты);
		СтруктураДокумента.Вставить("Организация", СтруктураОрганизация);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗагрузитьДанные_Организцаия(Атрибуты, ТЗ = Неопределено)
			
	СтруктураДокумента = новый Структура;
	//ПолучитьСтандартныеАтрибуты(СтруктураДокумента, ЧтениеXML);
	СтруктураДокумента.Вставить("ГУИД", Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияГУИД").Значение); 
	СтруктураДокумента.Вставить("Наименование",Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияНаименование").Значение); 
	СтруктураДокумента.Вставить("Префикс",Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияПрефикс").Значение);
	СтруктураДокумента.Вставить("ИНН",Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияИНН").Значение); 
	СтруктураДокумента.Вставить("КПП",Атрибуты.ПолучитьИменованныйЭлемент("", "ОрганизацияКПП").Значение);
	
	Возврат СтруктураДокумента;
	
КонецФункции

#КонецОбласти

#КонецЕсли
